// 博客的云环境ID
export const env = 'react-blog-admin-8fo571wf24c87f9';

// 博客后台管理的网址
export const blogAdminUrl =
  'https://react-blog-admin-8fo571wf24c87f9-1304393382.ap-shanghai.app.tcloudbase.com/';

// siteCount ID
export const count_id = 'cd045e756100126d005169f014931c65';

// 博客运行起始日
export const time = '2020-12-16 14:00:00';

// 首页每页显示多少篇文章
export const homePageSize = 8;
// 文章页每页显示多少篇文章
export const articlesPageSize = 10;

// 管理员信息
export const adminUid = 'dbee9976b3c14448a06f2006a4795cf2';
export const adminName = '飞鸟';
export const adminQQ = '965555169';
export const adminQQEmail = '965555169@qq.com';
export const adminUrl = 'https://lzxjack.top/';
export const adminUrlCheck = 'lzxjack.top';
// 头像
export const avatarUrl = 'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20201204121004.jpg';

// 博客背景图片
export const blogBackGroundImgs = [
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210818111500.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210818111501.png',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210818111502.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20211126190312.jpg'
];
// 背景图选择
export const imgNum = 3;

// 个人友链信息
export const myName = '飞鸟';
export const myLink = 'https://lzxjack.top/';
export const myAvatar = 'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20201204121004.jpg';
export const myDescr = '一只平凡的鸟罢了。';

// 默认评论头像（空头像）
export const defaultCommentAvatar =
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210807103114.png';
// 默认头像集合（若用户没获取QQ头像，则随机显示此数组中的头像）
export const defaultCommentAvatarArr = [
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221909.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221910.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221911.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221912.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221913.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221914.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221915.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221916.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221917.jpg',
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210826221918.jpg'
];

// 评论回复时，发送邮件提醒的API地址
export const emailApi =
  'https://react-blog-admin-8fo571wf24c87f9-1304393382.ap-shanghai.app.tcloudbase.com/sendemail';

// 微信二维码地址
export const weChatQRCode =
  'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210719213208.jpg';

// QQ二维码地址
export const QQ_QRCode = 'https://cdn.jsdelivr.net/gh/lzxjack/img/img/20210719214515.jpg';

// emoji表情
export const emojiPeople =
  '😄😆😊😃😏😍😘😚😳😌😆😁😉😜😝😀😗😙😛😴😟😦😧😮😬😕😯😑😒😅😓😥😩😔😞😖😨😰😣😢😭😂😲😱😫😠😡😤😪😋😷😎😵👿😈😐😶😇👽💛💙💜❤️💚💔💓💗💕💞💘💖✨⭐🌟💫💥💥💢❗❓❕❔💤💨💦🎶🎵🔥💩💩💩👍👍👎👎👌👊👊✊✌️👋✋✋👐☝️👇👈👉🙌🙏👆👏💪🤘🖕🏃🏃👫👪👬👭💃👯🙆‍♀️🙅💁🙋👰🙇💏💑💆💇💅👦👧👩👨👶👵👴👲👳‍♂️👷👮👼👸😺😸😻😽😼🙀😿😹😾👹👺🙈🙉🙊💂‍♂️💀🐾👄💋💧👂👀👃👅💌👤👥💬💭';
export const emojiNature =
  '☀️☔☁️❄️⛄⚡🌀🌁🌊🐱🐶🐭🐹🐰🐺🐸🐯🐨🐻🐷🐽🐮🐗🐵🐒🐴🐎🐫🐑🐘🐼🐍🐦🐤🐥🐣🐔🐧🐢🐛🐝🐜🐞🐌🐙🐠🐟🐳🐋🐬🐄🐏🐀🐃🐅🐇🐉🐐🐓🐕🐖🐁🐂🐲🐡🐊🐪🐆🐈🐩🐾💐🌸🌷🍀🌹🌻🌺🍁🍃🍂🌿🍄🌵🌴🌲🌳🌰🌱🌼🌾🐚🌐🌞🌝🌚🌑🌒🌓🌔🌕🌖🌗🌘🌜🌛🌙🌍🌎🌏🌋🌌⛅';
export const emojiObj =
  '🎍💝🎎🎒🎓🎏🎆🎇🎐🎑🎃👻🎅🎄🎁🔔🔕🎋🎉🎊🎈🔮💿📀💾📷📹🎥💻📺📱☎️☎️📞📟📠💽📼🔉🔈🔇📢📣⌛⏳⏰⌚📻📡➿🔍🔎🔓🔒🔏🔐🔑💡🔦🔆🔅🔌🔋📲✉️📫📮🛀🛁🚿🚽🔧🔩🔨💺💰💸📧📥📤✉️📨📯📪📬📭📦🚪🚬💣🔫🔪💊💉📆📅📇📁📂✂️📌📎✒️✏️📏📐📘📚🔖📛🔬🔭📰🏈🏀⚽⚾🎾🎱🎱🏉🎳⛳🚵🚴🏇🏂🏊🏄🎿💎💍🏆🎼🎹🎻👾🎮🃏🎴🎲🎯🀄🎬👔👚👗🎽👖👘👙🎀🎩👑👒👞🌂💼👜👝👛👓🎣☕🍵🍶🍼🍺🍻🍸🍹🍷🍴🍕🍔🍟🍗🍖🍝🍛🍤🍱🍣🍥🍙🍘🍚🍜🍲🍢🍡🥚🍞🍩🍮🍦🍨🍧🎂🍰🍪🍫🍬🍭🍯🍎🍏🍊🍋🍒🍇🍉🍓🍑🍈🍌🍐🍍🍠🍆🍅🌽';
export const emojiPlace =
  '🏠🏡🏫🏢🏣🏥🏦🏪🏩🏨💒⛪🏬🏤🌇🌆🏯🏰⛺🏭🗼🗾🗻🌄🌅🌠🗽🌉🎠🌈🎡⛲🎢🚢🚤⛵⛵🚣⚓🚀✈️🚁🚂🚊🚞🚲🚡🚟🚠🚜🚙🚘🚗🚗🚕🚖🚛🚌🚍🚨🚓🚔🚒🚑🚐🚚🚋🚉🚆🚅🚄🚈🚝🚃🚎🎫⛽🚦🚥⚠️🚧🔰🏧🎰🚏💈♨️🏁🎌🏮🗿🎪🎭📍🚩';
export const emojiSymbol =
  '◀️⬇️▶️⬅️🔠🔡🔤➡️⬆️⏬⏫🔽⤵️⤴️↩️↪️🔼🔃🔄⏪⏩ℹ️🆗🔀🔁🔂🆕🔝🆙🆒🆓🆖🎦🈁📶🈹🈴🈺🈯🈷️🈶🈵🈚🈸🈳🈲🈂️🚻🚹🚺🚼🚭🅿️♿🚇🛄🉑🚾🚰🚮㊙️㊗️Ⓜ️🛂🛅🛃🉐🆑🆘🆔🚫🔞📵🚯🚱🚳🚷🚸⛔✳️❇️✴️💟🆚📳📴💹💱♈♉♊♋♌♍♎♏♐♑♒♓⛎🔯❎🅰️🅱️🆎🅾️💠♻️🔚🔙🔛🔜💲❌❗⁉️⭕✖️➕➖➗💮💯✔️☑️🔘🔗➰🔱▪️▫️◾◽◼️◻️⬛⬜✅🔲🔳⚫⚪🔴🔵🔷🔶🔹🔸🔺🔻';
